import { TDiary, TExercise, TRecord } from '@shared/types';

const recordsMyRecord: TRecord[] = [
  {
    urlImage: '/images/record-01.png',
    title: 'body record',
    description: '自分のカラダの記録',
  },
  {
    urlImage: '/images/record-02.png',
    title: 'my exercise',
    description: '自分の運動の記録',
  },
  {
    urlImage: '/images/record-03.png',
    title: 'my diary',
    description: '自分の日記',
  },
];

const diariesMyRecord: TDiary[] = [
  {
    date: '2021.05.21',
    hour: '23:25',
    title: '私の日記の記録が一部表示されます。',
    desc: 'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
  },
  {
    date: '2021.05.21',
    hour: '23:25',
    title: '私の日記の記録が一部表示されます。',
    desc: 'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
  },
  {
    date: '2021.05.21',
    hour: '23:25',
    title: '私の日記の記録が一部表示されます。',
    desc: 'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
  },
  {
    date: '2021.05.21',
    hour: '23:25',
    title: '私の日記の記録が一部表示されます。',
    desc: 'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
  },
  {
    date: '2021.05.21',
    hour: '23:25',
    title: '私の日記の記録が一部表示されます。',
    desc: 'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
  },
  {
    date: '2021.05.21',
    hour: '23:25',
    title: '私の日記の記録が一部表示されます。',
    desc: 'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
  },
  {
    date: '2021.05.21',
    hour: '23:25',
    title: '私の日記の記録が一部表示されます。',
    desc: 'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
  },
  {
    date: '2021.05.21',
    hour: '23:25',
    title: '私の日記の記録が一部表示されます。',
    desc: 'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
  },
];

const exercisesMyRecord: TExercise[] = [
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
  {
    title: '家事全般（立位・軽い',
    time: '10 min',
    kcal: '26kcal',
  },
];

export { recordsMyRecord, diariesMyRecord, exercisesMyRecord };
